#Напишите программу, которая будет здороваться с пользователем по имени. 
# Для этого при запуске программа будет спрашивать имя у пользователя и после ввода имени выводить сообщение Hello {name}.

name = str(input('Hello! What\'s is your name?'))
print(f'Hello {name}')